examples/fuelTruck/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.000001;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.3;

maxAlphaCo      0.3;

maxDeltaT       0.001;

checkMeshCourantNo yes;

libs
(
    externalComm
);

functions
{
    FMUSimulator
    {
        type            FMUSimulator;
        libs            (pyFMUSim);
        pyClassName     FuelTruck;
        pyFileName      FuelTruck;
    }

    forces
    {
        type            forces;
        libs            (forces);
        patches         (".*");
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            (0 0 0);
    }
}


// ************************************************************************* //
