examples/fuelTruck/system/externalCouplingDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      externalCouplingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

externalFunctions
{
    extForces
    {
        type            extForces;
        patches         (".*");
        CofR            (0 0 0);
        CofRName        CofR_in;
        forceName       f_out;
        momentName      m_out;
    }


}
// ************************************************************************* //
